; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-8-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-3 - location
	p0-6 - location
	p2-5 - location
	p2-6 - location
	p2-9 - location
	p3-0 - location
	p4-5 - location
	p4-8 - location
	p6-3 - location
	p6-5 - location
	p6-7 - location
	p6-8 - location
	p7-4 - location
	p8-1 - location
	p9-0 - location
	p9-4 - location
	p9-5 - location
	)
	(:init
	(at driver1 s6)
	(at driver2 s6)
	(at driver3 s8)
	(at driver4 s2)
	(at driver5 s6)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s9)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s9)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s0)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s6)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s6)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s1)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s4)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s5)
	(at package2 s3)
	(at package3 s3)
	(at package4 s3)
	(at package5 s1)
	(at package6 s8)
	(at package7 s6)
	(at package8 s7)
	(at package9 s9)
	(at package10 s8)
	(at package11 s9)
	(at package12 s6)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-8)
	(path p4-8 s4)
	(path s8 p4-8)
	(path p4-8 s8)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-4)
	(path p7-4 s7)
	(path s4 p7-4)
	(path p7-4 s4)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(path s9 p9-5)
	(path p9-5 s9)
	(path s5 p9-5)
	(path p9-5 s5)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 84)
	(= (time-to-drive s1 s0) 84)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 95)
	(= (time-to-drive s8 s0) 95)
	(link s0 s9)
	(link s9 s0)
	(= (time-to-drive s0 s9) 27)
	(= (time-to-drive s9 s0) 27)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 87)
	(= (time-to-drive s2 s1) 87)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 80)
	(= (time-to-drive s6 s1) 80)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 80)
	(= (time-to-drive s0 s2) 80)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 45)
	(= (time-to-drive s3 s2) 45)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 49)
	(= (time-to-drive s4 s2) 49)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 49)
	(= (time-to-drive s7 s2) 49)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 38)
	(= (time-to-drive s0 s3) 38)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 80)
	(= (time-to-drive s1 s3) 80)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 95)
	(= (time-to-drive s6 s3) 95)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 17)
	(= (time-to-drive s9 s3) 17)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 88)
	(= (time-to-drive s0 s4) 88)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 84)
	(= (time-to-drive s7 s4) 84)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 95)
	(= (time-to-drive s9 s4) 95)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 93)
	(= (time-to-drive s4 s5) 93)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 28)
	(= (time-to-drive s6 s5) 28)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 59)
	(= (time-to-drive s7 s5) 59)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 81)
	(= (time-to-drive s0 s6) 81)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 73)
	(= (time-to-drive s4 s6) 73)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 74)
	(= (time-to-drive s7 s6) 74)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 68)
	(= (time-to-drive s5 s8) 68)
	(link s8 s7)
	(link s7 s8)
	(= (time-to-drive s8 s7) 77)
	(= (time-to-drive s7 s8) 77)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 33)
	(= (time-to-drive s7 s9) 33)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s6)
	(at driver4 s5)
	(at truck1 s9)
	(at truck2 s5)
	(at truck3 s4)
	(at truck4 s8)
	(at truck7 s8)
	(at package1 s9)
	(at package2 s5)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s1)
	(at package7 s7)
	(at package9 s5)
	(at package10 s0)
	(at package11 s5)
	))

(:metric minimize (+ (* 1 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (board-truck driver5 truck1 s6)
   deleted: (at driver5 s6) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 2 of 18
2. (load-truck package7 truck1 s6)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 18
3. (drive-truck truck1 s6 s1 driver5)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 880
   goals met: 2 of 18
4. (walk driver4 s2 p2-9)
   deleted: (at driver4 s2)
   added: (at driver4 p2-9)
   goals met: 2 of 18
5. (walk driver1 s6 p0-6)
   deleted: (at driver1 s6)
   added: (at driver1 p0-6)
   goals met: 2 of 18
6. (walk driver1 p0-6 s0)
   deleted: (at driver1 p0-6)
   added: (at driver1 s0)
   goals met: 3 of 18
7. (walk driver4 p2-9 s2)
   deleted: (at driver4 p2-9)
   added: (at driver4 s2)
   goals met: 3 of 18
8. (walk driver4 s2 p2-5)
   deleted: (at driver4 s2)
   added: (at driver4 p2-5)
   goals met: 3 of 18
9. (walk driver1 s0 p9-0)
   deleted: (at driver1 s0)
   added: (at driver1 p9-0)
   goals met: 2 of 18
10. (walk driver1 p9-0 s9)
   deleted: (at driver1 p9-0)
   added: (at driver1 s9)
   goals met: 2 of 18
11. (walk driver4 p2-5 s5)
   deleted: (at driver4 p2-5)
   added: (at driver4 s5)
   goals met: 3 of 18
12. (board-truck driver1 truck2 s9)
   deleted: (at driver1 s9) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 3 of 18
13. (load-truck package9 truck2 s9)
   deleted: (at package9 s9)
   added: (in package9 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 3 of 18
14. (load-truck package11 truck2 s9)
   deleted: (at package11 s9)
   added: (in package11 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 3 of 18
15. (disembark-truck driver5 truck1 s1)
   deleted: (driving driver5 truck1)
   added: (at driver5 s1) (empty truck1)
   goals met: 3 of 18
16. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 18
17. (drive-truck truck2 s9 s3 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   changed: (fuel-used) from 880 to 1101
   goals met: 3 of 18
18. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 3 of 18
19. (drive-truck truck2 s3 s0 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (fuel-used) from 1101 to 1709
   goals met: 3 of 18
20. (drive-truck truck2 s0 s8 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   changed: (fuel-used) from 1709 to 3229
   goals met: 3 of 18
21. (load-truck package6 truck2 s8)
   deleted: (at package6 s8)
   added: (in package6 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 3 of 18
22. (load-truck package10 truck2 s8)
   deleted: (at package10 s8)
   added: (in package10 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 18
23. (walk driver4 s5 p9-5)
   deleted: (at driver4 s5)
   added: (at driver4 p9-5)
   goals met: 2 of 18
24. (walk driver4 p9-5 s9)
   deleted: (at driver4 p9-5)
   added: (at driver4 s9)
   goals met: 2 of 18
25. (drive-truck truck2 s8 s0 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 3229 to 5604
   goals met: 2 of 18
26. (unload-truck package10 truck2 s0)
   deleted: (in package10 truck2)
   added: (at package10 s0)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 3 of 18
27. (drive-truck truck2 s0 s2 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   changed: (fuel-used) from 5604 to 7204
   goals met: 3 of 18
28. (walk driver2 s6 p0-6)
   deleted: (at driver2 s6)
   added: (at driver2 p0-6)
   goals met: 2 of 18
29. (walk driver4 s9 p9-5)
   deleted: (at driver4 s9)
   added: (at driver4 p9-5)
   goals met: 2 of 18
30. (walk driver4 p9-5 s5)
   deleted: (at driver4 p9-5)
   added: (at driver4 s5)
   goals met: 3 of 18
31. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (fuel-used) from 7204 to 8104
   goals met: 3 of 18
32. (load-truck package3 truck2 s3)
   deleted: (at package3 s3)
   added: (in package3 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 3 of 18
33. (load-truck package4 truck2 s3)
   deleted: (at package4 s3)
   added: (in package4 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 3 of 18
34. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (fuel-used) from 8104 to 9499
   goals met: 3 of 18
35. (unload-truck package3 truck2 s2)
   deleted: (in package3 truck2)
   added: (at package3 s2)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 4 of 18
36. (drive-truck truck2 s2 s0 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   changed: (fuel-used) from 9499 to 11499
   goals met: 4 of 18
37. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 11499 to 13524
   goals met: 4 of 18
38. (walk driver2 p0-6 s6)
   deleted: (at driver2 p0-6)
   added: (at driver2 s6)
   goals met: 5 of 18
39. (walk driver4 s5 p9-5)
   deleted: (at driver4 s5)
   added: (at driver4 p9-5)
   goals met: 4 of 18
40. (walk driver4 p9-5 s9)
   deleted: (at driver4 p9-5)
   added: (at driver4 s9)
   goals met: 4 of 18
41. (board-truck driver4 truck3 s9)
   deleted: (at driver4 s9) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 4 of 18
42. (drive-truck truck3 s9 s4 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (fuel-used) from 13524 to 14474
   goals met: 5 of 18
43. (drive-truck truck2 s6 s1 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   changed: (fuel-used) from 14474 to 16474
   goals met: 5 of 18
44. (unload-truck package6 truck2 s1)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 6 of 18
45. (load-truck package7 truck2 s1)
   deleted: (at package7 s1)
   added: (in package7 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 6 of 18
46. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 7 of 18
47. (drive-truck truck3 s4 s5 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 16474 to 17404
   goals met: 6 of 18
48. (load-truck package1 truck3 s5)
   deleted: (at package1 s5)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 6 of 18
49. (drive-truck truck3 s5 s4 driver4)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 17404 to 18427
   goals met: 7 of 18
50. (drive-truck truck3 s4 s9 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   changed: (fuel-used) from 18427 to 19472
   goals met: 6 of 18
51. (unload-truck package1 truck3 s9)
   deleted: (in package1 truck3)
   added: (at package1 s9)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 7 of 18
52. (drive-truck truck2 s1 s6 driver1)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   changed: (fuel-used) from 19472 to 21072
   goals met: 7 of 18
53. (drive-truck truck3 s9 s4 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s4)
   changed: (fuel-used) from 21072 to 22022
   goals met: 8 of 18
54. (drive-truck truck3 s4 s5 driver4)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (fuel-used) from 22022 to 22952
   goals met: 7 of 18
55. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 8 of 18
56. (drive-truck truck2 s6 s7 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   changed: (fuel-used) from 22952 to 24432
   goals met: 8 of 18
57. (unload-truck package7 truck2 s7)
   deleted: (in package7 truck2)
   added: (at package7 s7)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 9 of 18
58. (drive-truck truck2 s7 s5 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   changed: (fuel-used) from 24432 to 25376
   goals met: 10 of 18
59. (unload-truck package2 truck2 s5)
   deleted: (in package2 truck2)
   added: (at package2 s5)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 11 of 18
60. (unload-truck package9 truck2 s5)
   deleted: (in package9 truck2)
   added: (at package9 s5)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 12 of 18
61. (unload-truck package11 truck2 s5)
   deleted: (in package11 truck2)
   added: (at package11 s5)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 13 of 18
62. (walk driver2 s6 p0-6)
   deleted: (at driver2 s6)
   added: (at driver2 p0-6)
   goals met: 12 of 18
63. (walk driver2 p0-6 s0)
   deleted: (at driver2 p0-6)
   added: (at driver2 s0)
   goals met: 12 of 18
64. (board-truck driver2 truck4 s0)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 18
65. (drive-truck truck2 s5 s8 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (fuel-used) from 25376 to 26056
   goals met: 11 of 18
66. (drive-truck truck4 s0 s8 driver2)
   deleted: (at truck4 s0)
   added: (at truck4 s8)
   changed: (fuel-used) from 26056 to 27006
   goals met: 12 of 18
67. (drive-truck truck2 s8 s0 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   changed: (fuel-used) from 27006 to 27956
   goals met: 12 of 18
68. (disembark-truck driver2 truck4 s8)
   deleted: (driving driver2 truck4)
   added: (at driver2 s8) (empty truck4)
   goals met: 12 of 18
69. (walk driver2 s8 p6-8)
   deleted: (at driver2 s8)
   added: (at driver2 p6-8)
   goals met: 12 of 18
70. (walk driver2 p6-8 s6)
   deleted: (at driver2 p6-8)
   added: (at driver2 s6)
   goals met: 13 of 18
71. (drive-truck truck2 s0 s6 driver1)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 27956 to 28766
   goals met: 13 of 18
72. (drive-truck truck2 s6 s5 driver1)
   deleted: (at truck2 s6)
   added: (at truck2 s5)
   changed: (fuel-used) from 28766 to 29046
   goals met: 14 of 18
73. (board-truck driver4 truck3 s5)
   deleted: (at driver4 s5) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 13 of 18
74. (disembark-truck driver1 truck2 s5)
   deleted: (driving driver1 truck2)
   added: (at driver1 s5) (empty truck2)
   goals met: 13 of 18
75. (disembark-truck driver4 truck3 s5)
   deleted: (driving driver4 truck3)
   added: (at driver4 s5) (empty truck3)
   goals met: 14 of 18
76. (board-truck driver1 truck3 s5)
   deleted: (at driver1 s5) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 14 of 18
77. (drive-truck truck3 s5 s4 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   changed: (fuel-used) from 29046 to 29976
   goals met: 15 of 18
78. (drive-truck truck3 s4 s0 driver1)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   changed: (fuel-used) from 29976 to 30856
   goals met: 14 of 18
79. (disembark-truck driver1 truck3 s0)
   deleted: (driving driver1 truck3)
   added: (at driver1 s0) (empty truck3)
   goals met: 15 of 18
80. (board-truck driver5 truck7 s1)
   deleted: (at driver5 s1) (empty truck7)
   added: (driving driver5 truck7)
   goals met: 15 of 18
81. (drive-truck truck7 s1 s0 driver5)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   changed: (fuel-used) from 30856 to 31696
   goals met: 15 of 18
82. (drive-truck truck7 s0 s8 driver5)
   deleted: (at truck7 s0)
   added: (at truck7 s8)
   changed: (fuel-used) from 31696 to 32646
   goals met: 16 of 18
83. (disembark-truck driver5 truck7 s8)
   deleted: (driving driver5 truck7)
   added: (at driver5 s8) (empty truck7)
   goals met: 16 of 18
84. (board-truck driver1 truck3 s0)
   deleted: (at driver1 s0) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 15 of 18
85. (drive-truck truck3 s0 s1 driver1)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   changed: (fuel-used) from 32646 to 33486
   goals met: 15 of 18
86. (walk driver3 s8 p8-1)
   deleted: (at driver3 s8)
   added: (at driver3 p8-1)
   goals met: 15 of 18
87. (disembark-truck driver1 truck3 s1)
   deleted: (driving driver1 truck3)
   added: (at driver1 s1) (empty truck3)
   goals met: 15 of 18
88. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 15 of 18
89. (walk driver5 s8 p8-1)
   deleted: (at driver5 s8)
   added: (at driver5 p8-1)
   goals met: 15 of 18
90. (disembark-truck driver1 truck1 s1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s1) (empty truck1)
   goals met: 15 of 18
91. (walk driver3 p8-1 s1)
   deleted: (at driver3 p8-1)
   added: (at driver3 s1)
   goals met: 15 of 18
92. (board-truck driver3 truck3 s1)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 15 of 18
93. (walk driver5 p8-1 s1)
   deleted: (at driver5 p8-1)
   added: (at driver5 s1)
   goals met: 15 of 18
94. (board-truck driver5 truck1 s1)
   deleted: (at driver5 s1) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 15 of 18
95. (drive-truck truck1 s1 s0 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 33486 to 34326
   goals met: 15 of 18
96. (drive-truck truck3 s1 s0 driver3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   changed: (fuel-used) from 34326 to 35166
   goals met: 15 of 18
97. (drive-truck truck1 s0 s1 driver5)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 35166 to 36006
   goals met: 15 of 18
98. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 15 of 18
99. (drive-truck truck1 s1 s3 driver5)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   changed: (fuel-used) from 36006 to 36806
   goals met: 15 of 18
100. (board-truck driver3 truck3 s0)
   deleted: (at driver3 s0) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 15 of 18
101. (drive-truck truck3 s0 s4 driver3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   changed: (fuel-used) from 36806 to 37686
   goals met: 16 of 18
102. (disembark-truck driver5 truck1 s3)
   deleted: (driving driver5 truck1)
   added: (at driver5 s3) (empty truck1)
   goals met: 16 of 18
103. (board-truck driver2 truck6 s6)
   deleted: (at driver2 s6) (empty truck6)
   added: (driving driver2 truck6)
   goals met: 15 of 18
104. (board-truck driver5 truck1 s3)
   deleted: (at driver5 s3) (empty truck1)
   added: (driving driver5 truck1)
   goals met: 15 of 18
105. (drive-truck truck1 s3 s9 driver5)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   changed: (fuel-used) from 37686 to 37856
   goals met: 16 of 18
106. (drive-truck truck6 s6 s1 driver2)
   deleted: (at truck6 s6)
   added: (at truck6 s1)
   changed: (fuel-used) from 37856 to 38656
   goals met: 16 of 18
107. (disembark-truck driver2 truck6 s1)
   deleted: (driving driver2 truck6)
   added: (at driver2 s1) (empty truck6)
   goals met: 16 of 18
108. (board-truck driver1 truck6 s1)
   deleted: (at driver1 s1) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 16 of 18
109. (drive-truck truck6 s1 s0 driver1)
   deleted: (at truck6 s1)
   added: (at truck6 s0)
   changed: (fuel-used) from 38656 to 39496
   goals met: 16 of 18
110. (disembark-truck driver1 truck6 s0)
   deleted: (driving driver1 truck6)
   added: (at driver1 s0) (empty truck6)
   goals met: 17 of 18
111. (walk driver2 s1 p8-1)
   deleted: (at driver2 s1)
   added: (at driver2 p8-1)
   goals met: 17 of 18
112. (walk driver2 p8-1 s8)
   deleted: (at driver2 p8-1)
   added: (at driver2 s8)
   goals met: 17 of 18
113. (walk driver2 s8 p6-8)
   deleted: (at driver2 s8)
   added: (at driver2 p6-8)
   goals met: 17 of 18
114. (walk driver2 p6-8 s6)
   deleted: (at driver2 p6-8)
   added: (at driver2 s6)
   goals met: 18 of 18
